When we run a plan with this config change against `pilot-hubs`, we get the following output

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # google_container_cluster.cluster will be updated in-place
  ~ resource "google_container_cluster" "cluster" {
        id                          = "projects/two-eye-two-see/locations/us-central1-b/clusters/pilot-hubs-cluster"
        name                        = "pilot-hubs-cluster"
        # (29 unchanged attributes hidden)

        # (23 unchanged blocks hidden)
    }

  # google_filestore_instance.homedirs["filestore"] will be created
  + resource "google_filestore_instance" "homedirs" {
      + create_time = (known after apply)
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-central1-b"
      + name        = "pilot-hubs-homedirs"
      + project     = "two-eye-two-see"
      + tier        = "BASIC_HDD"
      + zone        = (known after apply)

      + file_shares {
          + capacity_gb   = 5120
          + name          = "homes"
          + source_backup = (known after apply)
        }

      + networks {
          + connect_mode      = "DIRECT_PEERING"
          + ip_addresses      = (known after apply)
          + modes             = [
              + "MODE_IPV4",
            ]
          + network           = "default"
          + reserved_ip_range = (known after apply)
        }
    }

  # google_monitoring_notification_channel.pagerduty_disk_space will be updated in-place
  ~ resource "google_monitoring_notification_channel" "pagerduty_disk_space" {
        id           = "projects/two-eye-two-see/notificationChannels/2203982305292521130"
        name         = "projects/two-eye-two-see/notificationChannels/2203982305292521130"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_service_account_key.cd_sa will be updated in-place
  ~ resource "google_service_account_key" "cd_sa" {
        id                 = "projects/two-eye-two-see/serviceAccounts/pilot-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com/keys/ee245c75f6c3fa5a36ae59597b356f4c6da80334"
        name               = "projects/two-eye-two-see/serviceAccounts/pilot-hubs-cd-sa@two-eye-two-see.iam.gserviceaccount.com/keys/ee245c75f6c3fa5a36ae59597b356f4c6da80334"
        # (8 unchanged attributes hidden)
    }

  # google_service_account_key.registry_sa_keys["binder-staging"] will be updated in-place
  ~ resource "google_service_account_key" "registry_sa_keys" {
        id                 = "projects/two-eye-two-see/serviceAccounts/binder-staging-registry-sa@two-eye-two-see.iam.gserviceaccount.com/keys/195042aa9b5edc2b3502736bd2d99daa7c5c9877"
        name               = "projects/two-eye-two-see/serviceAccounts/binder-staging-registry-sa@two-eye-two-see.iam.gserviceaccount.com/keys/195042aa9b5edc2b3502736bd2d99daa7c5c9877"
        # (8 unchanged attributes hidden)
    }

  # google_service_account_key.registry_sa_keys["binderhub-ui-demo"] will be updated in-place
  ~ resource "google_service_account_key" "registry_sa_keys" {
        id                 = "projects/two-eye-two-see/serviceAccounts/binderhub-ui-demo-registry-sa@two-eye-two-see.iam.gserviceaccount.com/keys/7ad6294d83c8adb31c2e286e56f61a7d9f447f13"
        name               = "projects/two-eye-two-see/serviceAccounts/binderhub-ui-demo-registry-sa@two-eye-two-see.iam.gserviceaccount.com/keys/7ad6294d83c8adb31c2e286e56f61a7d9f447f13"
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.
╷
│ Error: Instance cannot be destroyed
│ 
│   on storage.tf line 1:
│    1: resource "google_filestore_instance" "homedirs" {
│ 
│ Resource google_filestore_instance.homedirs[0] has lifecycle.prevent_destroy set, but the plan calls for this resource to be destroyed. To avoid this error and continue with the plan,
│ either disable lifecycle.prevent_destroy or reduce the scope of the plan using the -target flag.
╵
```

This is because terraform is trying to move `google_filestore_instance.homedirs[0]` to `google_filestore_instance.homedirs["filestore"]` (even though both filestores ahve the same name and other identical properties).